hurrican/hurrican-acceptance-test/src/citrus/resources/templates/location/v1/AvailabilityService_02/SEARCH_BUILDINGS_REQUEST.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <v1:searchBuildings xmlns:v1="http://www.mnet.de/esb/cdm/Resource/LocationService/v1">
      <v1:city>
        <v1:name>city1</v1:name>
      </v1:city>
      <v1:zipCode>
        <v1:zipCode>zip123</v1:zipCode>
      </v1:zipCode>
      <v1:streetSection>
        <v1:name>street</v1:name>
      </v1:streetSection>
      <v1:building>
        <v1:houseNumber>abc</v1:houseNumber>
      </v1:building>
    </v1:searchBuildings>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>